[
  {
    "name": "Acer UN.31ZSI.006 Premium Business Laptop Ryzen 7 5700U 16GB RAM 512GB SSD Windows 11 Home SL 15.6\" Matte Black Finish Ultimate Power  MS Office",
    "description": "Power through your workday with the Acer UN.31ZSI.006 equipped with a high-performance AMD Ryzen 7 5700U and 16GB of RAM for smooth multitasking, fast app launches, and reliable performance under pressure. The large 512GB SSD ensures quick boot times and plenty of room for files and projects, all displayed beautifully on a 15.6-inch Full HD anti-glare screen in an elegant Matte Black chassis to keep you looking sharp. Comes with the latest Windows 11 Home Single Language, offering enhanced security and productivity tools. This laptop arrives factory unboxed, assuring a brand-new, unrefurbished device with pristine condition. It comes backed by an exclusive 1-year MaxTech warranty, providing comprehensive hardware defect coverage and easy access to professional support and hassle-free repairs, so you can focus fully on your grind. Complete with MS Office to keep documents, presentations, and spreadsheets ready to roll from day one, this model blends style, power, and peace of mind for the ultimate business companion.",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 40000,
    "sellingPrice": 39000.0,
    "categories": [
      "Laptops",
      "Editor",
      "Creator"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71JEGsayyGL._AC_UY218_.jpg"
     
      
    ],
    "brand": "Acer"
  },
  {
    "name": "Acer UN.34YSI.00K Ultralight Everyday Intel Core i3 13th Gen 8GB RAM 512GB SSD Windows 11 Home SL 14\" Silver  Sleek Design  MS Office",
    "description": "Elevate your daily computing experience with the Acer UN.34YSI.00K featuring the latest 13th Generation Intel Core i3 processor and 8GB RAM for smooth multitasking across web browsing, streaming, and productivity apps. With a speedy 512GB SSD, file access and system boot times are significantly reduced, housed in a classy Silver chassis that is as stylish as it is portable. The 14-inch Full HD display delivers vibrant colors and clear visuals ideal for both work and entertainment. Windows 11 Home Single Language powers the experience with enhanced security and intuitive interface, plus streamlined updates. Delivered factory unboxed, guaranteeing a fresh, untouched unit with no prior use. The 1-year MaxTech warranty offered covers all hardware defects and provides direct access to dependable customer support, ensuring minimal downtime and maximum productivity. Featuring pre-installed MS Office, this laptop makes document editing and collaborative work fast and easy. The perfect blend of elegance, performance, and reliable service for students, professionals, and everyday users.",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 33000,
    "sellingPrice": 32175.0,
    "categories": [
      "Laptops",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/61yC4DN4asL._AC_UY218_.jpg"
    ],
    "brand": "Acer"
  },
  {
    "name": "Dell Latitude 3440 Business Laptop Intel Core i3 12th Gen 8GB RAM 512GB SSD Windows 11 Pro Platinum Silver 14\" Anti-Glare Screen  Durable Slim Body  MS Office",
    "description": "Designed for business trailblazers, the Dell Latitude 3440 packs 12th Gen Intel Core i3 power alongside 8GB of RAM and a fast 512GB SSD to effortlessly juggle multiple applications, large files, and intensive workflows. Its Platinum Silver finish adds a premium touch to the durable and slim chassis, featuring a 14-inch Full HD anti-glare display that comfortably supports long work sessions. Windows 11 Professional delivers robust security and advanced features essential for enterprise environments. Factory-unboxed to guarantee brand-new condition, this laptop is protected by a comprehensive 1-year MaxTech warranty designed to cover hardware defects with prompt, professional service and support, enhancing your peace of mind. Plus, MS Office comes pre-loaded to keep your documents, sheets, and presentations ready whenever you are. A perfect balance of style, performance, and professional support tailored for accelerated productivity in modern workspaces.",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 30000,
    "sellingPrice": 29250.0,
    "categories": [
      "Laptops",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71+gQ9gOTuL._AC_UY218_.jpg"
    ],
    "brand": "Dell"
  },
  {
    "name": "Dell Latitude 3540 Business Laptop Intel Core i3 12th Gen 8GB RAM 512GB SSD Windows 11 Pro Carbon Black 15.6\" Full HD Anti-Glare Long Battery Life  Rugged Design  MS Office",
    "description": "The Dell Latitude 3540 in sleek Carbon Black is engineered for those who need both power and portability. Its 12th Gen Intel Core i3 processor paired with 8GB RAM ensures seamless multitasking, while the spacious and fast 512GB SSD cuts down on waiting times and enhances responsiveness. The generous 15.6-inch Full HD anti-glare display eases eye strain for extended use. Windows 11 Professional equips you with the latest security and efficiency features for business-grade protection. This laptop arrives factory unboxed, guaranteeing newness, with a reassuring 1-year MaxTech warranty providing comprehensive hardware defect protection, fast repair services, and access to expert customer support. Bundled with MS Office, it’s ready to handle all your document creation and collaboration needs right out of the box. Robust, stylish, and supported by a trusted warranty, the Latitude 3540 is your go-to for professional success anywhere.",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 33000,
    "sellingPrice": 32175.0,
    "categories": [
      "Laptops",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/61yY4ZxfCrL._AC_UY218_.jpg"
    ],
    "brand": "Dell"
  },
  {
    "name": "Dell Latitude 3540 Business Laptop Premium 3-Year Warranty Intel Core i3 12th Gen 8GB RAM 512GB SSD Windows 11 Pro Carbon Black 15.6\" FHD Anti-Glare Display  Enhanced Protection  MS Office",
    "description": "Take your business tech to the next level with the Dell Latitude 3540 Premium featuring a 3-year MaxTech extended warranty providing unparalleled long-term coverage for hardware defects, proactive support, and hassle-free repairs. Powered by a 12th Gen Intel Core i3 and 8GB RAM, this machine excels at multitasking and fast data access with a 512GB SSD. The 15.6\" Full HD anti-glare display and sleek Carbon Black frame combine style and comfort for all-day use. Windows 11 Professional ensures you benefit from the latest productivity and security enhancements. Factory unboxed and ready to unleash productivity with pre-loaded MS Office, this laptop guarantees you’re geared for success with maximized uptime and dependable performance. Designed for the discerning professional, this is a device that works as hard as you do — and then some.",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 32500,
    "sellingPrice": 31687.5,
    "categories": [
      "Laptops",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/31-Si6DMapL._AC_UY218_.jpg"
    ],
    "brand": "Dell"
  },
  {
    "name": "ASUS Vivobook 15 E1504FA-NJ133WS AMD Ryzen 5 7520U Laptop (16GB RAM, 512GB SSD, Radeon Graphics, Windows 11 Home, MS Office Home & Student 2024, 15.6-inch FHD Anti-Glare Display, Quiet Blue, 1.7 KG)",
    "description": "Brand New Laptop- The ASUS Vivobook 15 E1504FA-NJ133WS is a sleek, lightweight, and performance-packed laptop designed for professionals and students who need ultimate portability without compromise. Powered by theAMD Ryzen 5 7520U processorandAMD Radeon Graphics, it delivers smooth multitasking and efficient computing for work, study, and entertainment. With16GB LPDDR5 RAMand a512GB SSD, you get ultra-fast boot times and seamless performance. The15.6-inch FHD anti-glare displayprovides crisp visuals for everyday use. Preloaded withWindows 11 HomeandMS Office Home & Student 2024, it is ready out of the box for productivity and learning. Compact and stylish inQuiet Blue, weighing just1.7 KG, it is perfect for users who need performance on the go.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:AMD Ryzen 5 7520U (4-Core, 8-Thread, up to 4.3GHz) |Memory:16GB LPDDR5-5500 RAM (On-board) |Storage:512GB M.2 NVMe PCIe 3.0 SSD |Graphics:AMD Radeon 610M Graphics |Display:15.6\" FHD (1920x1080) Anti-Glare, LED Backlit, 60Hz |Operating System:Windows 11 Home Pre-installed |Office Suite:MS Office Home & Student 2024 Pre-installed |Color:Quiet Blue |Weight:1.7 KG |Dimensions:35.95 x 23.24 x 1.79 cm |Connectivity:WiFi 6 (802.11ax), Bluetooth 5.3 |Ports:1x USB 3.2 Gen 1 Type-A, 2x USB 2.0 Type-A, 1x USB 3.2 Gen 1 Type-C, 1x HDMI 1.4, 1x 3.5mm Audio Jack |Keyboard:Full-size Chiclet Keyboard with Numeric Keypad |Security:Fingerprint Reader |Audio:SonicMaster Audio Technology, Built-in Stereo Speakers |Battery:42WHrs 3-Cell Li-ion Battery |Webcam:720p HD Webcam with Privacy Shutter",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 37990,
    "sellingPrice": 36999.0,
    "categories": [
      "Laptops",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71zMooVIVAL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS TUF Gaming A15 FA506NCG-HN200WS AMD Ryzen 5 7535HS Gaming Laptop (16GB RAM, 512GB SSD, NVIDIA RTX 3050 4GB, Windows 11 Home, MS Office 2024, 15.6-inch 144Hz FHD Display, Graphite Black, 2.3 KG)",
    "description": "Brand New Laptop- The ASUS TUF Gaming A15 FA506NCG-HN200WS is built for gamers, creators, and power-users who demand reliability and toughness. Driven by theAMD Ryzen 5 7535HS processorwithNVIDIA GeForce RTX 3050 4GB graphics, it delivers high-performance gaming, incredible rendering power, and flawless multitasking. With16GB DDR5 RAMand512GB SSD, you can load games, software, and projects at lightning speed. The15.6\" Full HD display with 144Hz refresh rateguarantees immersive, smooth graphics with reduced lag. Military-grade durability, stylishGraphite Black finish, and2.3 KG weightmake it a tough and travel-friendly gaming companion. Preloaded withWindows 11 HomeandMS Office 2024, it is ready from day one.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:AMD Ryzen 5 7535HS (6-Core, 12-Thread, up to 4.55GHz) |Memory:16GB DDR5-4800 RAM (2x 8GB SO-DIMM, Upgradeable to 32GB) |Storage:512GB M.2 NVMe PCIe 4.0 SSD |Graphics:NVIDIA GeForce RTX 3050 Laptop GPU 4GB GDDR6 |Display:15.6\" FHD (1920x1080) IPS-Type, 144Hz Refresh Rate, Anti-Glare |Operating System:Windows 11 Home Pre-installed |Office Suite:MS Office Home & Student 2024 Pre-installed |Color:Graphite Black |Weight:2.3 KG |Dimensions:35.4 x 25.1 x 2.24~2.76 cm |Connectivity:WiFi 6 (802.11ax), Bluetooth 5.3 |Ports:1x USB 3.2 Gen 2 Type-C, 3x USB 3.2 Gen 1 Type-A, 1x HDMI 2.0b, 1x RJ45 LAN, 1x 3.5mm Audio Jack |Keyboard:RGB Backlit Gaming Keyboard with WASD Highlighted Keys |Audio:DTS:X Ultra Audio, Built-in Array Microphone, Hi-Res Audio |Battery:90WHrs 4-Cell Li-ion Battery |Webcam:720p HD Webcam |Certification:Military-Grade MIL-STD-810H Tested |Cooling:TUF Gaming Self-Cleaning Cooling System",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 72990,
    "sellingPrice": 71499.0,
    "categories": [
      "Laptops",
      "Gaming"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/81nPkLHN3vL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS TUF Gaming A16 FA607NUG-RL189WS AMD Ryzen 7 7840HS Gaming Laptop (16GB RAM, 512GB SSD, NVIDIA RTX 4050 6GB, Windows 11 Home, MS Office 2024, 16-inch 165Hz WUXGA Display, Mecha Gray, 2.2 KG)",
    "description": "Brand New Laptop- The ASUS TUF Gaming A16 FA607NUG-RL189WS is a true performance beast designed for hardcore gamers and creative users. Featuring theAMD Ryzen 7 7840HS processorandNVIDIA RTX 4050 6GB GPU, this machine delivers stunning visuals and rapid processing power for gaming, video editing, and 3D applications. The16GB DDR5 RAMand512GB SSDprovide lightning-speed performance with effortless multitasking capabilities. Its16\" WUXGA display with 165Hz refresh rateensures lifelike visuals that enhance both competitive gaming and multimedia experiences. With aMecha Gray military-grade buildweighing just2.2 KG, it offers durability combined with portability. Pre-installed withWindows 11 HomeandMS Office Home & Student 2024, it is both game-ready and productivity-ready.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:AMD Ryzen 7 7840HS (8-Core, 16-Thread, up to 5.1GHz) |Memory:16GB DDR5-5600 RAM (2x 8GB SO-DIMM, Upgradeable to 32GB) |Storage:512GB M.2 NVMe PCIe 4.0 SSD (Expandable with 1x M.2 Slot) |Graphics:NVIDIA GeForce RTX 4050 Laptop GPU 6GB GDDR6 |Display:16\" WUXGA (1920x1200) IPS-Level, 165Hz Refresh Rate, 3ms Response Time, Anti-Glare |Operating System:Windows 11 Home Pre-installed |Office Suite:MS Office Home & Student 2024 Pre-installed |Color:Mecha Gray |Weight:2.2 KG |Dimensions:35.4 x 25.1 x 2.19~2.76 cm |Connectivity:WiFi 6E (802.11ax), Bluetooth 5.3 |Ports:1x USB 3.2 Gen 2 Type-C (with DisplayPort & Power Delivery), 3x USB 3.2 Gen 1 Type-A, 1x HDMI 2.1, 1x RJ45 LAN, 1x 3.5mm Audio Jack |Keyboard:RGB Backlit Gaming Keyboard with Overstroke Technology |Audio:DTS:X Ultra Audio, AI Noise Canceling, Hi-Res Audio Certified |Battery:90WHrs 4-Cell Li-ion Battery (Up to 13 Hours) |Webcam:720p HD Webcam with Privacy Shutter |Certification:Military-Grade MIL-STD-810H Tested |Cooling:Arc Flow Fans with Self-Cleaning Anti-Dust Tunnels",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 99990,
    "sellingPrice": 96999.0,
    "categories": [
      "Laptops",
      "Gaming"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/81+DaZP4aSL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS TUF Gaming F15 FX507VU-LP210W Intel Core i7 13th Gen Gaming Laptop (16GB RAM, 512GB SSD, NVIDIA RTX 4050 6GB, Windows 11 Home, MS Office 2024, 15.6-inch 144Hz FHD IPS Display, Mecha Gray, 2.2 KG)",
    "description": "Brand New Laptop- Built to conquer, the ASUS TUF Gaming F15 FX507VU-LP210W offers elite-level gaming and productivity performance. Powered by theIntel Core i7 13th Gen processorpaired withNVIDIA GeForce RTX 4050 GPU with 6GB VRAM, it ensures visual brilliance with advanced ray tracing and AI rendering. Its16GB DDR5 RAMand512GB SSDallow lag-free multitasking and rapid data access. The15.6-inch FHD IPS display with 144Hz refresh ratekeeps visuals sharp, vibrant, and stutter-free for both gaming and content creation. Military-tested ruggedness withMecha Grayfinishing and a lightweight2.2 KG buildmake it reliable and portable. Preloaded withWindows 11 HomeandMS Office 2024, the FX507VU-LP210W is a complete package for gamers, professionals, and creators alike.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:Intel Core i7-13620H (10-Core, 16-Thread, up to 4.9GHz) |Memory:16GB DDR5-4800 RAM (2x 8GB SO-DIMM, Upgradeable to 32GB) |Storage:512GB M.2 NVMe PCIe 4.0 SSD (Expandable with 1x M.2 Slot) |Graphics:NVIDIA GeForce RTX 4050 Laptop GPU 6GB GDDR6 |Display:15.6\" FHD (1920x1080) IPS-Level, 144Hz Refresh Rate, Anti-Glare, 250 nits Brightness |Operating System:Windows 11 Home Pre-installed |Office Suite:MS Office Home & Student 2024 Pre-installed |Color:Mecha Gray |Weight:2.2 KG |Dimensions:35.4 x 25.1 x 2.24~2.76 cm |Connectivity:WiFi 6 (802.11ax), Bluetooth 5.3 |Ports:1x Thunderbolt 4 Type-C (with DisplayPort & Power Delivery), 3x USB 3.2 Gen 1 Type-A, 1x HDMI 2.1, 1x RJ45 LAN, 1x 3.5mm Audio Jack |Keyboard:RGB Backlit Gaming Keyboard with Overstroke Technology |Audio:DTS:X Ultra Audio, AI Noise Canceling Technology, Hi-Res Audio |Battery:90WHrs 4-Cell Li-ion Battery (Fast Charging Support) |Webcam:720p HD Webcam with Privacy Shutter |Certification:Military-Grade MIL-STD-810H Tested |Cooling:Arc Flow Fans with Anti-Dust Tunnels and Thermal Grizzly Liquid Metal",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 97990,
    "sellingPrice": 95999.0,
    "categories": [
      "Laptops",
      "Gaming"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/81PaO9Q1WFL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS TUF Gaming F16 FX607VB-RL076WS Intel Core i5 13th Gen Gaming Laptop (16GB RAM, 512GB SSD, NVIDIA RTX 4060 8GB, Windows 11 Home, MS Office 2024, 16-inch 165Hz WUXGA Display, Mecha Gray, 2.35 KG)",
    "description": "Brand New Laptop- The ASUS TUF Gaming F16 FX607VB-RL076WS is built for next-gen gamers and professionals chasing high-level performance. Boasting anIntel Core i5 13th Gen processorwithNVIDIA RTX 4060 GPU (8GB VRAM), it powers through AAA games and creative workloads effortlessly. Backed by16GB DDR5 RAMand a512GB SSD, this laptop ensures fluid rendering, faster app response, and no-compromise multitasking. The16-inch WUXGA 165Hz displayenhances gameplay to the highest detail, offering stunning clarity and smoothness. Strengthened with military-grade durability, strikingMecha Gray finish, and2.35 KG lightweight design, it combines ruggedness with portability. Comes ready withWindows 11 HomeandMS Office Home & Student 2024.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:Intel Core i5-13500H (12-Core, 16-Thread, up to 4.7GHz) |Memory:16GB DDR5-4800 RAM (2x 8GB SO-DIMM, Upgradeable to 32GB) |Storage:512GB M.2 NVMe PCIe 4.0 SSD (Expandable with 1x M.2 Slot) |Graphics:NVIDIA GeForce RTX 4060 Laptop GPU 8GB GDDR6 |Display:16\" WUXGA (1920x1200) IPS-Level, 165Hz Refresh Rate, 3ms Response Time, Anti-Glare, 300 nits Brightness |Operating System:Windows 11 Home Pre-installed |Office Suite:MS Office Home & Student 2024 Pre-installed |Color:Mecha Gray |Weight:2.35 KG |Dimensions:35.4 x 25.1 x 2.19~2.76 cm |Connectivity:WiFi 6E (802.11ax), Bluetooth 5.3 |Ports:1x Thunderbolt 4 Type-C (with DisplayPort & Power Delivery), 3x USB 3.2 Gen 2 Type-A, 1x HDMI 2.1, 1x RJ45 LAN, 1x 3.5mm Audio Jack |Keyboard:RGB Backlit Gaming Keyboard with N-Key Rollover |Audio:DTS:X Ultra Audio, AI Noise Canceling, Dolby Atmos, Hi-Res Audio |Battery:90WHrs 4-Cell Li-ion Battery (Up to 14 Hours Battery Life) |Webcam:720p HD Webcam with Privacy Shutter |Certification:Military-Grade MIL-STD-810H Tested |Cooling:Arc Flow Fans with Thermal Grizzly Liquid Metal Compound",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 74990,
    "sellingPrice": 72999.0,
    "categories": [
      "Laptops",
      "Gaming"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71VkbzKU+FL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS Zenbook 14 OLED UX3405CA-PZ345WS Intel Core Ultra 5 225H Laptop (16GB LPDDR5X RAM, 1TB SSD, Intel Arc Graphics, Windows 11 Home, MS Office Home & Student 2024, 14-inch 3K OLED 120Hz Touch Display, Foggy Silver, 1.39 KG)",
    "description": "Brand New Laptop- The ASUS Zenbook 14 OLED UX3405CA-PZ345WS represents the pinnacle of premium ultraportable computing, designed for professionals, creatives, and students who demand exceptional performance and visual excellence. Powered by the cutting-edgeIntel Core Ultra 5 225H processorwith built-in NPU for AI acceleration andIntel Arc Graphics, this laptop delivers remarkable speed and efficiency for productivity, content creation, and multitasking. With16GB LPDDR5X RAMand alightning-fast 1TB PCIe 4.0 SSD, you get instantaneous boot times, seamless application switching, and ample storage for all your files and projects. The stunning14-inch 3K OLED touchscreen display with 120Hz refresh rateoffers breathtaking color accuracy, deep blacks, and smooth scrolling that brings your work and entertainment to life. Its ultra-slimFoggy Silverpremium aluminum chassis weighing just1.39 KGmakes it incredibly portable without sacrificing durability. Pre-installed withWindows 11 HomeandMS Office Home & Student 2024, it's ready for productivity from day one.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:Intel Core Ultra 5 225H (14-Core, up to 4.5GHz, AI NPU up to 11TOPS) |Memory:16GB LPDDR5X-5600 RAM (On-board, Non-upgradeable) |Storage:1TB M.2 NVMe PCIe 4.0 SSD (Expandable with 1x M.2 Slot) |Graphics:Intel Arc Graphics |Display:14\" 3K OLED (2880x1800) Touch, 120Hz Refresh Rate, 500nits HDR, 100% DCI-P3, 0.2ms Response Time |Operating System:Windows 11 Home Pre-installed |Office Suite:MS Office Home & Student 2024 Pre-installed |Color:Foggy Silver |Weight:1.39 KG |Dimensions:31.16 x 21.81 x 1.39 cm |Connectivity:WiFi 6E (802.11ax), Bluetooth 5.3 |Ports:2x Thunderbolt 4 Type-C (with DisplayPort & Power Delivery), 1x USB 3.2 Gen 1 Type-A, 1x HDMI 2.1, 1x 3.5mm Audio Jack |Keyboard:Backlit Chiclet Keyboard with NumberPad 2.0 |Security:Fingerprint Reader, IR Camera for Windows Hello |Audio:Harman Kardon Certified Audio, Dolby Atmos, Built-in Array Microphone |Battery:75WHrs 4-Cell Li-ion Battery (Up to 18 Hours) |Webcam:1080p FHD Webcam with Privacy Shutter |Certification:ENERGY STAR, EPEAT Gold",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 104990,
    "sellingPrice": 101999.0,
    "categories": [
      "Laptops",
      "Office"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71n6Fs5KQPL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS Zenbook A14 OLED UX3407QA-QD259WS Snapdragon X X1 26-100 Copilot+ PC Laptop (16GB LPDDR5X RAM, 512GB SSD, Qualcomm Adreno GPU, Windows 11 Home, MS Office Home & Student 2024, 14-inch WUXGA OLED Display, Iceland Gray, 0.98 KG)",
    "description": "Brand New Laptop- The ASUS Zenbook A14 OLED UX3407QA-QD259WS is a revolutionary Copilot+ PC that redefines ultra-portable computing with cutting-edge ARM-based architecture. Powered by theSnapdragon X X1 26-100 processorwithQualcomm Hexagon NPU delivering up to 45 TOPSfor advanced AI tasks, this laptop offers exceptional performance and industry-leading battery life. With16GB LPDDR5X RAMand a512GB PCIe 4.0 SSD, it ensures smooth multitasking and rapid data access. The vibrant14-inch WUXGA OLED displaydelivers stunning visuals with perfect blacks and vivid colors for an immersive viewing experience. Its ultra-lightweightIceland Graydesign at just0.98 KGmakes it the perfect travel companion for professionals and students on the go. Built-in AI features enhance productivity, while theQualcomm Adreno GPUhandles graphics tasks efficiently. Pre-loaded withWindows 11 HomeandMS Office Home & Student 2024, it's ready for work and creativity right out of the box.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:Snapdragon X X1 26-100 (8-Core ARM, up to 2.97GHz, Qualcomm Hexagon NPU up to 45 TOPS) |Memory:16GB LPDDR5X RAM (On-board, Non-upgradeable) |Storage:512GB M.2 NVMe PCIe 4.0 SSD |Graphics:Qualcomm Adreno GPU (Integrated) |Display:14\" WUXGA OLED (1920x1200) 16:10 Aspect Ratio, Anti-Glare, Touch Support |Operating System:Windows 11 Home Pre-installed (Copilot+ PC Features) |Office Suite:MS Office Home & Student 2024 Pre-installed |Color:Iceland Gray |Weight:0.98 KG |Dimensions:31.16 x 21.81 x 1.34 cm |Connectivity:WiFi 7 (802.11be), Bluetooth 5.4 |Ports:2x USB 4.0 Type-C (with DisplayPort & Power Delivery), 1x USB 3.2 Gen 1 Type-A, 1x 3.5mm Audio Jack |Keyboard:Backlit Chiclet Keyboard |Security:Fingerprint Reader, IR Camera for Windows Hello, Microsoft Pluton Security |Audio:Harman Kardon Certified Audio, Dolby Atmos, AI Noise Canceling |Battery:70WHrs 3-Cell Li-ion Battery (Up to 34 Hours) |Webcam:1080p FHD Webcam with Privacy Shutter |Certification:US MIL-STD 810H Military-Grade Standard |AI Features:Windows Copilot, Live Captions, Studio Effects, Voice Clarity",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 92990,
    "sellingPrice": 90999.0,
    "categories": [
      "Laptops",
      "Creator"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/81PaO9Q1WFL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS TUF Gaming F16 FX607VB-RL087WS Intel Core 5 210H Gaming Laptop (16GB DDR4 RAM, 512GB SSD, NVIDIA GeForce RTX 3050A 4GB, Windows 11 Home, MS Office Home & Student 2024, 16-inch FHD+ 144Hz WUXGA Display, Mecha Gray, 2.2 KG)",
    "description": "Brand New Laptop- The ASUS TUF Gaming F16 FX607VB-RL087WS is built for gamers and creators who demand reliable performance in a rugged, portable package. Powered by the efficientIntel Core 5 210H processorwith 8 cores and 12 threads, paired with theNVIDIA GeForce RTX 3050A GPU with 4GB GDDR6 VRAM, this gaming laptop delivers smooth gameplay and creative workflows. Equipped with16GB DDR4 RAMand afast 512GB PCIe 4.0 SSD, it ensures rapid game loading and seamless multitasking across demanding applications. The16-inch FHD+ WUXGA display with 144Hz refresh rateprovides fluid, tear-free visuals perfect for competitive gaming and content creation. Built with military-grade durability and featuring advanced cooling technology, theMecha Graychassis can withstand daily use while maintaining optimal performance. At2.2 KG, it strikes the perfect balance between portability and gaming power. Pre-installed withWindows 11 HomeandMS Office Home & Student 2024, it's ready for both gaming and productivity.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:Intel Core 5 210H (8-Core, 12-Thread, up to 4.8GHz, 12MB Cache) |Memory:16GB DDR4-3200 SO-DIMM (Upgradeable to 64GB, Dual Channel) |Storage:512GB M.2 NVMe PCIe 4.0 SSD (Expandable with 1x M.2 Slot) |Graphics:NVIDIA GeForce RTX 3050A Laptop GPU 4GB GDDR6, 2195MHz at 65W |Display:16\" FHD+ (1920x1200) WUXGA IPS-Level, 144Hz Refresh Rate, 3ms Response Time, Anti-Glare, MUX Switch + NVIDIA Advanced Optimus |Operating System:Windows 11 Home Pre-installed |Office Suite:MS Office Home & Student 2024 Pre-installed |Color:Mecha Gray |Weight:2.2 KG |Dimensions:35.4 x 25.1 x 2.24~2.76 cm |Connectivity:WiFi 6 (802.11ax), Bluetooth 5.3 |Ports:1x USB 3.2 Gen 2 Type-C (DisplayPort & Power Delivery), 2x USB 3.2 Gen 1 Type-A, 1x HDMI 2.1, 1x RJ45 LAN, 1x 3.5mm Audio Jack |Keyboard:RGB Backlit Gaming Keyboard with Anti-Ghosting |Audio:DTS:X Ultra Audio, AI Noise Canceling, Hi-Res Audio |Battery:90WHrs 4-Cell Li-ion Battery |Webcam:720p HD Webcam |Certification:Military-Grade MIL-STD-810H Tested |Cooling:TUF Gaming Self-Cleaning Cooling System with Arc Flow Fans",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 74990,
    "sellingPrice": 72499.0,
    "categories": [
      "Laptops",
      "Gaming"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71oGM-26fZL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS TUF Gaming F16 FX608JH-RV057WS Intel Core i5 13450HX Gaming Laptop (16GB DDR5 RAM, 1TB SSD, NVIDIA GeForce RTX 5050 8GB, Windows 11 Home, MS Office Home & Student 2024, 16-inch WUXGA 165Hz Display, Jaeger Gray, 2.2 KG)",
    "description": "Brand New Laptop- The ASUS TUF Gaming F16 FX608JH-RV057WS represents the next generation of gaming performance with cutting-edge hardware and superior build quality. Powered by theIntel Core i5 13450HX processorwith 10 cores (6 P-cores + 4 E-cores) and the latestNVIDIA GeForce RTX 5050 GPU with 8GB GDDR7 VRAM, this laptop delivers exceptional gaming and creative performance with advanced ray tracing and AI capabilities. Featuring16GB DDR5 RAMand a massive1TB PCIe 4.0 SSD, it provides lightning-fast performance and generous storage for games, applications, and media. The16-inch WUXGA display with 165Hz refresh rateensures ultra-smooth gameplay with crystal-clear visuals and minimal input lag. The military-testedJaeger Graychassis combines durability with style, while advanced thermal management keeps performance optimal during extended gaming sessions. At just2.2 KG, it's surprisingly portable for such a powerful gaming machine. Comes ready withWindows 11 HomeandMS Office Home & Student 2024for immediate productivity.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:Intel Core i5-13450HX (10-Core, 16-Thread, up to 4.6GHz, 20MB Cache, 6 P-cores + 4 E-cores) |Memory:16GB DDR5-5600 SO-DIMM (Upgradeable to 64GB, Dual Channel) |Storage:1TB M.2 NVMe PCIe 4.0 SSD (Expandable with 1x M.2 Slot) |Graphics:NVIDIA GeForce RTX 5050 Laptop GPU 8GB GDDR7, 115W (100W+15W Dynamic Boost) |Display:16\" WUXGA (1920x1200) IPS-Level, 165Hz Refresh Rate, Anti-Glare, 100% sRGB, 75.35% Adobe RGB, G-Sync Support, MUX Switch + NVIDIA Advanced Optimus |Operating System:Windows 11 Home Pre-installed |Office Suite:MS Office Home & Student 2024 Pre-installed |Color:Jaeger Gray |Weight:2.2 KG |Dimensions:35.4 x 26.9 x 1.79 cm |Connectivity:WiFi 6E (802.11ax), Bluetooth 5.3 |Ports:1x USB 3.2 Gen 2 Type-C (DisplayPort & Power Delivery), 3x USB 3.2 Gen 2 Type-A, 1x HDMI 2.1 FRL, 1x RJ45 LAN, 1x 3.5mm Audio Combo |Keyboard:RGB Backlit Gaming Keyboard with N-Key Rollover |Audio:Dolby Atmos, AI Noise Cancellation, Dual Speakers |Battery:90WHrs 4-Cell Li-ion Battery |Webcam:720p HD Webcam with Privacy Shutter |Certification:Military-Grade MIL-STD-810H Tested |Cooling:Advanced Arc Flow Fans with Self-Cleaning Anti-Dust Tunnels",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 119990,
    "sellingPrice": 116999.0,
    "categories": [
      "Laptops",
      "Creator"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/81nPkLHN3vL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS ROG Strix SCAR 16 G635LW-RW157WS Intel Core Ultra 9 275HX Gaming Laptop (32GB DDR5 RAM, 2TB SSD, NVIDIA GeForce RTX 5080 16GB, Windows 11 Home, MS Office Home & Student 2024, 16-inch 2.5K Mini LED 240Hz Display, Eclipse Gray, 2.8 KG)",
    "description": "Brand New Laptop- The ASUS ROG Strix SCAR 16 G635LW-RW157WS is the ultimate gaming powerhouse designed for esports champions and content creators who demand the absolute best performance. Powered by the flagshipIntel Core Ultra 9 275HX processorwith 24 cores and 24 threads plus integrated AI NPU delivering up to 13 TOPS, combined with the monstrousNVIDIA GeForce RTX 5080 GPU with 16GB GDDR7 VRAM, this laptop dominates every AAA game and creative workload with ease. Equipped with massive32GB DDR5-5600 RAMand2TB PCIe 4.0 SSD, it handles the most demanding multitasking scenarios, 4K content creation, and instant game loading. The stunning16-inch 2.5K Mini LED display with 240Hz refresh rateand ROG Nebula HDR technology delivers incredibly smooth, high-resolution gaming with exceptional color accuracy and G-Sync support. The premiumEclipse Graydesign features advanced ROG Intelligent Cooling with liquid metal thermal compound and tool-less upgrade access for sustained peak performance. Despite its powerful internals, it maintains a reasonable2.8 KGweight for a flagship gaming laptop. Pre-loaded withWindows 11 HomeandMS Office Home & Student 2024for immediate productivity and gaming dominance.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:Intel Core Ultra 9 275HX (24-Core, 24-Thread, up to 5.4GHz, 36MB Cache, Intel AI Boost NPU up to 13TOPS) |Memory:32GB DDR5-5600 SO-DIMM (Upgradeable to 64GB, Dual Channel) |Storage:2TB M.2 NVMe PCIe 4.0 SSD (Expandable with Additional M.2 Slot) |Graphics:NVIDIA GeForce RTX 5080 Laptop GPU 16GB GDDR7, ROG Boost 1550MHz at 175W (150W+25W Dynamic Boost) |Display:16\" 2.5K WQXGA (2560x1600) 16:10 ROG Nebula HDR Mini LED, 240Hz Refresh Rate, 3ms Response Time, 100% DCI-P3, Pantone Validated, G-Sync, Dolby Vision HDR |Operating System:Windows 11 Home Pre-installed |Office Suite:MS Office Home & Student 2024 Pre-installed |Color:Eclipse Gray |Weight:2.8 KG |Dimensions:35.4 x 25.9 x 2.34 cm |Connectivity:WiFi 6E (802.11ax), Bluetooth 5.3 |Ports:2x Thunderbolt 5 (DisplayPort & Power Delivery, up to 120Gbps), 3x USB 3.2 Gen 2 Type-A, 1x HDMI 2.1 FRL, 1x 2.5G LAN, 1x 3.5mm Audio Combo |Keyboard:Per-Key RGB Backlit Gaming Keyboard with Anti-Ghosting |Audio:Dolby Atmos, Hi-Res Audio, Smart Amplifier, Dual Speakers |Battery:90WHrs 4-Cell Li-ion Battery (Fast Charging Support) |Webcam:1080p FHD Webcam with Privacy Shutter |Certification:ROG Tool-less Upgrade Design |Cooling:ROG Intelligent Cooling with Liquid Metal Thermal Compound, Triple Fan Design, MUX Switch + NVIDIA Advanced Optimus",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 379990,
    "sellingPrice": 369999.0,
    "categories": [
      "Laptops",
      "Gaming"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/8174YnTefkL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS Vivobook 14 M1407KA-LY132WS AMD Ryzen AI 5 330 Copilot+ PC Laptop (16GB DDR5 RAM, 512GB SSD, AMD Radeon 820M Graphics, Windows 11 Home, MS Office Home & Student 2024, 14-inch WUXGA Anti-Glare Display, Quiet Blue, 1.46 KG)",
    "description": "Brand New Laptop- The ASUS Vivobook 14 M1407KA-LY132WS is a revolutionary Copilot+ PC that combines cutting-edge AI technology with everyday computing excellence. Powered by theAMD Ryzen AI 5 330 processorwith 4 cores and 8 threads plusAMD XDNA NPU delivering up to 50 TOPSfor advanced AI acceleration, this laptop delivers exceptional performance and industry-leading battery life for productivity and creativity tasks. With16GB DDR5 onboard RAMand a512GB PCIe 4.0 SSD, it ensures smooth multitasking and rapid data access for all your applications and files. The crisp14-inch WUXGA anti-glare displaywith 300 nits brightness provides comfortable viewing in any lighting condition while maintaining excellent color accuracy. Its ultra-lightweightQuiet Bluepremium design at just1.46 KGmakes it the perfect companion for students and professionals who need powerful AI features on the go. Built-in Windows Copilot AI features enhance productivity with intelligent assistance, while theAMD Radeon 820M graphicshandles multimedia tasks efficiently. Pre-loaded withWindows 11 HomeandMS Office Home & Student 2024, it's ready for work, study, and AI-powered creativity from day one.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:AMD Ryzen AI 5 330 (4-Core, 8-Thread, up to 4.5GHz, 12MB Cache, AMD XDNA NPU up to 50TOPS) |Memory:16GB DDR5 On-board (Upgradeable to 32GB with 1x SO-DIMM Slot) |Storage:512GB M.2 NVMe PCIe 4.0 SSD (Expandable with 1x M.2 Slot) |Graphics:AMD Radeon 820M Graphics (128 Stream Processors, 2800MHz) |Display:14\" WUXGA (1920x1200) 16:10 IPS-Level, 60Hz, 300nits Brightness, 45% NTSC Color Gamut, Anti-Glare, TÃœV Rheinland Certified |Operating System:Windows 11 Home Pre-installed (Copilot+ PC Features) |Office Suite:MS Office Home & Student 2024 Pre-installed |Color:Quiet Blue |Weight:1.46 KG |Dimensions:31.16 x 22.34 x 1.59 cm |Connectivity:WiFi 6 (802.11ax), Bluetooth 5.3 |Ports:2x USB 3.2 Gen 1 Type-C, 2x USB 3.2 Gen 1 Type-A, 1x HDMI 1.4, 1x 3.5mm Audio Jack |Keyboard:Backlit Chiclet Keyboard with Number Pad |Security:Fingerprint Reader, IR Camera for Windows Hello |Audio:SonicMaster Audio, AI Noise Canceling, Built-in Array Microphone |Battery:50WHrs 3-Cell Li-ion Battery (Up to 15 Hours) |Webcam:720p HD Webcam with Privacy Shutter |AI Features:Windows Copilot, AI-Enhanced Performance, Voice Recognition |Certification:ENERGY STAR Certified, 87% Screen-to-body Ratio",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 65990,
    "sellingPrice": 63999.0,
    "categories": [
      "Laptops",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71zMooVIVAL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS Vivobook 16X K3605VC-RP412W Intel Core i5 13420H Gaming Laptop (16GB DDR4 RAM, 512GB SSD, NVIDIA GeForce RTX 3050 4GB, Windows 11 Home, MS Office Home & Student 2024, 16-inch WUXGA 144Hz Display, Indie Black, 1.8 KG)",
    "description": "Brand New Laptop- The ASUS Vivobook 16X K3605VC-RP412W is designed for creators and gamers who need powerful performance in a stylish, portable package. Powered by theIntel Core i5-13420H processorwith 8 cores (4 P-cores + 4 E-cores) and 12 threads, paired with theNVIDIA GeForce RTX 3050 GPU with 4GB GDDR6 VRAM, this laptop delivers excellent gaming performance and creative workflows with DLSS support and ray tracing capabilities. Equipped with16GB DDR4 RAM(expandable to 24GB) and a512GB PCIe 4.0 SSD, it provides smooth multitasking and rapid loading times for games and applications. The large16-inch WUXGA display with 144Hz refresh rateensures fluid, immersive visuals perfect for gaming and content creation, while the 16:10 aspect ratio provides more vertical space for productivity. The sleekIndie Blackdesign with military-grade durability weighs just1.8 KG, making it surprisingly portable for a 16-inch gaming laptop. Advanced features include 180-degree hinge flexibility, ASUS ErgoSense keyboard, and comprehensive IO connectivity. Pre-installed withWindows 11 HomeandMS Office Home & Student 2024for immediate productivity and gaming enjoyment.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:Intel Core i5-13420H (8-Core, 12-Thread, up to 4.6GHz, 12MB Cache, 4 P-cores + 4 E-cores) |Memory:16GB DDR4-3200 (8GB On-board + 8GB SO-DIMM, Upgradeable to 24GB) |Storage:512GB M.2 NVMe PCIe 4.0 SSD (Expandable with 1x M.2 Slot) |Graphics:NVIDIA GeForce RTX 3050 Laptop GPU 4GB GDDR6, 1755MHz at 75W |Display:16\" WUXGA (1920x1200) 16:10 IPS-Level, 144Hz Refresh Rate, 300nits Brightness, Anti-Glare, 85% Screen-to-body Ratio |Operating System:Windows 11 Home Pre-installed |Office Suite:MS Office Home & Student 2024 + Microsoft 365 Basic (1 Year) |Color:Indie Black |Weight:1.8 KG |Dimensions:35.4 x 25.1 x 1.89 cm |Connectivity:WiFi 6E (802.11ax), Bluetooth 5.3 |Ports:1x USB 3.2 Gen 1 Type-C (Power Delivery), 2x USB 3.2 Gen 1 Type-A, 1x HDMI 2.1, 1x 3.5mm Audio Jack, 1x SD Card Reader |Keyboard:Backlit Chiclet Keyboard with Num-Key |Audio:Dirac Audio Enhancement, Built-in Speakers |Battery:50WHrs 3-Cell Li-ion Battery (Fast Charging Support) |Webcam:720p HD Webcam with Privacy Shutter |Design:180 Hinge, ASUS ErgoSense Keyboard, Webcam Shield |Certification:Military-Grade Durability Testing",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 69990,
    "sellingPrice": 67999.0,
    "categories": [
      "Laptops",
      "Gaming"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71wT57gW0hL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS Vivobook 16X K3605VC-RP413W Intel Core i5 13420H Creator Laptop (16GB DDR4 RAM, 512GB SSD, NVIDIA GeForce RTX 3050 4GB, Windows 11 Home, MS Office Home & Student 2024, 16-inch WUXGA 144Hz Display, Cool Silver, 1.8 KG)",
    "description": "Brand New Laptop- The ASUS Vivobook 16X K3605VC-RP413W is the perfect creator laptop that blends powerful performance with elegant design for content creators, students, and professionals. Featuring the robustIntel Core i5-13420H processorwith 8 cores and 12 threads, combined with theNVIDIA GeForce RTX 3050 GPU with 4GB GDDR6 VRAM, this laptop handles video editing, 3D rendering, graphic design, and gaming with remarkable efficiency. The dedicated GPU supports DLSS technology and ray tracing for enhanced visual experiences. With16GB DDR4 RAM(expandable to 24GB) and a512GB PCIe 4.0 SSD, it ensures seamless multitasking and quick access to large creative files. The expansive16-inch WUXGA display with 144Hz refresh rateprovides smooth, detailed visuals with a 16:10 aspect ratio that offers 11% more vertical space than traditional displays, perfect for creative workflows. The premiumCool Silverfinish with a lightweight1.8 KGdesign makes it both stylish and highly portable. Advanced features include NVIDIA Studio Driver support, 180-degree hinge flexibility, and comprehensive connectivity options. Pre-loaded withWindows 11 HomeandMS Office Home & Student 2024for immediate productivity.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:Intel Core i5-13420H (8-Core, 12-Thread, up to 4.6GHz, 12MB Cache, 4 P-cores + 4 E-cores) |Memory:16GB DDR4-3200 (8GB On-board + 8GB SO-DIMM, Upgradeable to 24GB) |Storage:512GB M.2 NVMe PCIe 4.0 SSD (Expandable with 1x M.2 Slot) |Graphics:NVIDIA GeForce RTX 3050 Laptop GPU 4GB GDDR6 with NVIDIA Studio Driver Support |Display:16\" WUXGA (1920x1200) 16:10 IPS-Level, 144Hz Refresh Rate, 300nits Brightness, Anti-Glare, 85% Screen-to-body Ratio |Operating System:Windows 11 Home Pre-installed |Office Suite:MS Office Home & Student 2024 + Microsoft 365 Basic (1 Year) |Color:Cool Silver |Weight:1.8 KG |Dimensions:35.4 x 25.1 x 1.89 cm |Connectivity:WiFi 6E (802.11ax), Bluetooth 5.3 |Ports:1x USB 3.2 Gen 1 Type-C (Power Delivery), 2x USB 3.2 Gen 1 Type-A, 1x HDMI 2.1, 1x 3.5mm Audio Jack, 1x SD Card Reader |Keyboard:Backlit Chiclet Keyboard with Num-Key |Audio:Dirac Audio Technology, Hi-Res Audio, Built-in Speakers |Battery:50WHrs 3-Cell Li-ion Battery (50% Charge in 30 Minutes) |Webcam:720p HD Webcam with Privacy Shutter |Design:180 Hinge Design, ASUS ErgoSense Keyboard, Webcam Shield |Certification:Military-Grade Durability, NVIDIA Studio Validated",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 69990,
    "sellingPrice": 67499.0,
    "categories": [
      "Laptops",
      "Creator"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71wT57gW0hL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS Vivobook S14 S3407CA-LY060WS Intel Core Ultra 5 225H AI Laptop (16GB DDR5 RAM, 512GB SSD, Intel UHD Graphics, Windows 11 Home, MS Office Home & Student 2024, 14-inch WUXGA IPS Anti-Glare Display, Cool Silver, 1.4 KG)",
    "description": "Brand New Laptop- The ASUS Vivobook S14 S3407CA-LY060WS is a premium AI-powered laptop designed for professionals and students who demand superior performance and portability. Powered by the cutting-edgeIntel Core Ultra 5 225H processorwith 14 cores (6 P-cores + 8 E-cores) andIntel AI Boost NPU delivering up to 13 TOPS, this laptop accelerates AI workloads and enhances productivity with intelligent features. Equipped with16GB DDR5 onboard RAMand a512GB PCIe 4.0 SSD, it delivers exceptional speed for multitasking, content creation, and data processing. The beautiful14-inch WUXGA IPS displaywith anti-glare coating and 300 nits brightness provides comfortable viewing in any environment while maintaining excellent color accuracy. The sleekCool Silverpremium aluminum design weighing just1.4 KGcombines elegance with durability, making it perfect for professionals on the move. Advanced AI features integrated into Windows 11 enhance user experience with intelligent performance optimization and productivity tools. Pre-installed withWindows 11 HomeandMS Office Home & Student 2024, it's ready for immediate productivity and creative work.Brand Warranty - To know more visit the warranty page on our website.\n\nKey Specs:Processor:Intel Core Ultra 5 225H (14-Core, 14-Thread, up to 4.9GHz, 18MB Cache, 6 P-cores + 8 E-cores, Intel AI Boost NPU up to 13TOPS) |Memory:16GB DDR5 On-board (Upgradeable to 32GB with 1x SO-DIMM Slot) |Storage:512GB M.2 NVMe PCIe 4.0 SSD (Expandable with 1x M.2 Slot) |Graphics:Intel UHD Graphics (Integrated, Shared Memory) |Display:14\" WUXGA (1920x1200) 16:10 IPS-Level, 60Hz, 300nits Brightness, 45% NTSC Color Gamut, Anti-Glare, TÃœV Rheinland Certified, 86% Screen-to-body Ratio |Operating System:Windows 11 Home Pre-installed (AI-Enhanced Features) |Office Suite:MS Office Home & Student 2024 Pre-installed |Color:Cool Silver |Weight:1.4 KG |Dimensions:31.52 x 22.34 x 1.59 cm |Connectivity:WiFi 6E (802.11ax), Bluetooth 5.3 |Ports:2x USB 3.2 Gen 1 Type-C, 2x USB 3.2 Gen 1 Type-A, 1x HDMI 1.4, 1x 3.5mm Audio Jack |Keyboard:Backlit Chiclet Keyboard |Security:Fingerprint Reader, TPM 2.0 Security Chip |Audio:Harman Kardon Certified Audio, Built-in Array Microphone |Battery:63WHrs 4-Cell Li-ion Battery (Up to 18 Hours) |Webcam:720p HD Webcam with Privacy Shutter |AI Features:Intel AI Boost NPU, Windows AI Acceleration, Intelligent Performance |Certification:ENERGY STAR, TÃœV Rheinland Eye Care Display",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 80990,
    "sellingPrice": 78999.0,
    "categories": [
      [
        "Laptops, Office, Student"
      ]
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71oGM-26fZL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS Vivobook Flip TP3402VAO-LZ619WS Intel Core Ultra 7 165H 2-in-1 Laptop (16GB LPDDR5X RAM, 1TB SSD, Intel Iris Xe Graphics, Windows 11 Home, MS Office Home & Student 2024, 14â€³ 3K OLED Touchscreen, Star Black, 1.4 KG)",
    "description": "Brand New Laptop The ASUS Vivobook Flip TP3402VAO-LZ619WS redefines versatility with its 360 hinge, transforming between laptop and tablet modes for work, creativity, and entertainment. Powered by theIntel Core Ultra 7 165H processor(10-Core: 6 P-cores + 4 E-cores, 16 Threads, up to 4.9 GHz Turbo, 18 MB L3 Cache, Intel AI NPU up to 13 TOPS) andIntel Iris Xe Graphics(up to 1.4 GHz execution units), it delivers powerful multitasking and smooth visuals. With16 GB LPDDR5X-6400 RAM(on-board, dual-channel) and a1 TB M.2 NVMe PCIe 4.0 SSD(upgradable via second M.2 slot), enjoy instant boot-up, rapid app loads, and massive storage. The stunning14â€³ 3K (2880Ã—1800) Dolby Vision OLED touchscreenwith 120 Hz refresh, 500 nits HDR, 0.2 ms response, 100% DCI-P3, and TÃœV Rheinland Eye Care ensures vibrant, fatigue-free viewing. Encased in a sleekStar BlackCNC-machined aluminum chassis weighing just1.4 KGand measuring 31.3Ã—21.8Ã—1.49 cm, this Vivobook Flip is both durable and ultra-portable. Preinstalled withWindows 11 HomeandMS Office Home & Student 2024, its ready for productivity and creativity.Brand Warranty  To know more visit the warranty page on our website.\n\nKey Specs:\n-  Processor: Intel Core Ultra 7 165H (10-Core16-Thread; 6Ã— P-cores @ 1.7-4.9 GHz + 4Ã— E-cores @ 1.2-3.7 GHz; 18 MB L3 Cache; 55 W TDP; AI NPU up to 13 TOPS)\n-  Graphics: Intel Iris Xe (96 EUs; up to 1.4 GHz; 4 MB L3 Shared Cache)\n-  Memory: 16 GB LPDDR5X-6400 (On-board; Dual-Channel; XMP Support; Non-upgradeable)\n-  Storage: 1 TB M.2 NVMe PCIe 4.0 SSD (Upgradable; Gen 4Ã—4; 3500 MBs Read, 3000 MBs Write)\n-  Display: 14â€³ OLED Touch (2880Ã—1800; 16:10; 120 Hz; 500 nits HDR; 100% DCI-P3; 0.2 ms; Dolby Vision; TÃœV Rheinland Eye Care)\n-  Audio: Harman Kardon-Certified Stereo Speakers; Dolby Atmos; Built-in AI Noise-Canceling Array Mic\n-  Webcam: 1080p FHD IR with Privacy Shutter; Windows Hello Support\n-  Keyboard: Backlit Chiclet; 1.4 mm Travel; ErgoSense",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 66990,
    "sellingPrice": 64999.0,
    "categories": [
      "Laptops",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71oGM-26fZL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS Vivobook Flip TP3407SA-QL025WS Snapdragon X Elite 2-in-1 AI Laptop (16GB LPDDR5 RAM, 512GB SSD, Qualcomm Adreno GPU, Windows 11 Home, MS Office Home & Student 2024, 14â€³ 2K Touch Display, Moonlight White, 1.2 KG)",
    "description": "Brand New Laptop The ASUS Vivobook Flip TP3407SA-QL025WS combines flagship AI performance with ultralight portability in a 360 convertible form factor. Driven by theSnapdragon X Elite 2 processor(8 ARM cores; up to 3.2 GHz; Qualcomm Hexagon NPU up to 60 TOPS) andQualcomm Adreno GPU, it accelerates Copilot+ AI tasks and multimedia workloads. Featuring16 GB LPDDR5-6400 RAM(On-board) and a512 GB M.2 NVMe PCIe 4.0 SSD, enjoy swift app launches and seamless multitasking. The14â€³ 2K (2160Ã—1350) AMOLED touchscreenwith 90 Hz, 400 nits, 100% sRGB, HDR10, and stylus support delivers vivid, precise visuals. Its CNC-machinedMoonlight Whitemagnesium-aluminum alloy chassis weighs only1.2 KG(Dimensions: 31.3Ã—21.4Ã—1.39 cm). Pre-loaded withWindows 11 Home (Copilot+ PC)andMS Office Home & Student 2024, its ready for AI-enhanced productivity.Brand Warranty  To know more visit the warranty page on our website.\n\nKey Specs:\n-  Processor: Snapdragon X Elite 2 (8-Core; up to 3.2 GHz; Hexagon NPU up to 60 TOPS; 12 W TDP)\n-  Graphics: Qualcomm Adreno Integrated GPU\n-  Memory: 16 GB LPDDR5-6400 (On-board; Dual-Channel; Non-upgradeable)\n-  Storage: 512 GB M.2 NVMe PCIe 4.0 SSD (Gen 3Ã—4; 3000 MBs Read; 2200 MBs Write)\n-  Display: 14â€³ AMOLED Touch (2160Ã—1350; 16:10; 90 Hz; 400 nits; 100% sRGB; HDR10; Stylus Support)\n-  Audio: Harman Kardon-Tuned Stereo Speakers; Dolby Atmos; AI Noise-Canceling Microphone\n-  Webcam: 1080p FHD IR with Shutter; Windows Hello\n-  Keyboard: Backlit Ultra-Slim Chiclet; 1.3 mm Travel; Precision Touchpad",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 108990,
    "sellingPrice": 105999.0,
    "categories": [
      "Laptops",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71zMooVIVAL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS Vivobook 15 V3607VU-RP550WS Intel Core Ultra 5 225H Laptop (16GB LPDDR5 RAM, 512GB SSD, Intel Iris Xe Graphics, Windows 11 Home, MS Office Home & Student 2024, 15.6â€³ FHD NanoEdge Display, Mist Green, 1.65 KG)",
    "description": "Brand New Laptop The ASUS Vivobook 15 V3607VU-RP550WS blends modern style with robust performance for students and professionals. Equipped with theIntel Core Ultra 5 225H processor(14-Core: 6 P-cores + 8 E-cores, up to 4.5 GHz, 11 TOPS AI NPU) andIntel Iris Xe Graphics(up to 1.4 GHz, 96 EUs), it handles multitasking, streaming, and content creation smoothly. Featuring16 GB LPDDR5-6400 RAMand a512 GB M.2 NVMe PCIe 4.0 SSD, it offers rapid app launches and swift file transfers. The expansive15.6â€³ FHD (1920Ã—1080) NanoEdge IPS displaywith 85% screen-to-body ratio delivers immersive visuals with 60 Hz, 250 nits brightness, and 45% NTSC. Housed in a chicMist Greenchassis weighing1.65 KG(35.7Ã—23.4Ã—1.7 cm), its both durable and portable. Preinstalled withWindows 11 HomeandMS Office Home & Student 2024, its ready for productivity and entertainment.Brand Warranty  To know more visit the warranty page on our website.\n\nKey Specs:\n-  Processor: Intel Core Ultra 5 225H (14-Core14-Thread; 6Ã— P-cores @ 2.5-4.5 GHz + 8Ã— E-cores @ 1.6-3.0 GHz; 18 MB Cache; AI NPU 11 TOPS; 28 W TDP)\n-  Graphics: Intel Iris Xe (96 EUs; up to 1.45 GHz)\n-  Memory: 16 GB LPDDR5-6400 (On-board; Dual-Channel; Non-upgradable)\n-  Storage: 512 GB M.2 NVMe PCIe 4.0 SSD (Gen 4Ã—4; 3500 MBs Read; 3000 MBs Write)\n-  Display: 15.6â€³ FHD IPS (1920Ã—1080) NanoEdge; 60 Hz; 250 nits; 45% NTSC; Anti-Glare\n-  Audio: SonicMaster with Smart Amp; AI Noise-Canceling Mic; Stereo Speakers\n-  Webcam: 720p HD with Privacy Shutter\n-  Keyboard: Backlit Chiclet; 1.4 mm Travel; Numeric Keypad\n-  Connectivity: WiFi 6E (802.11ax; 2Ã—2 MU-MIMO; 160 MHz); Bluetooth 5.3\n-  Ports: 1Ã— USB 4.0 Type-C; 2Ã— USB 3.2 Gen 1 Type-A; 1Ã— HDMI 1.4; 1Ã— 3.5 mm Combo\n-  Security: Fingerprint Reader (in power button); TPM 2.0; Kensington Lock Slot\n-  Battery: 50 WHr 3-Cell Li-ion; Fast Charge (060% in 42 min); Up to 12 hrs Web Browsing\n-  Power: 65 W USB-C Adapter; PD 3.0\n-  Weight & Dimensions: 1.65 KG; 35.7Ã—23.4Ã—1.7 cm\n-  Certifications: ENERGY STAR; EPEAT Silver",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 84990,
    "sellingPrice": 82999.0,
    "categories": [
      "Laptops",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71iACnZo-7L._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS VivoBook X1404VA-NK761WS Intel Core i3-1215U Laptop (8GB DDR4 RAM, 512GB SSD, Intel UHD Graphics, Windows 11 Home, MS Office Home & Student 2024, 14â€³ FHD Display, Indie Black, 1.45 KG)",
    "description": "Brand New Laptop The ASUS VivoBook X1404VA-NK761WS offers reliable everyday performance in a slim, lightweight form factor. Powered by theIntel Core i3-1215U processor(6-Core: 2 P-cores + 4 E-cores, up to 4.4 GHz Turbo, 12 MB Cache; 15 W TDP) withIntel UHD Graphics(12 EUs), it handles multitasking, streaming, and productivity apps with ease. Featuring8 GB DDR4-3200 RAMand a512 GB M.2 NVMe PCIe 3.0 SSD, it provides fast boot-up times and responsive performance. The14â€³ FHD (1920Ã—1080) LED-backlit displayoffers crisp visuals with 250 nits and anti-glare coating. Encased inIndie Blackand weighing1.45 KG(32.4Ã—21.2Ã—1.79 cm), its ideal for on-the-go use. Preinstalled withWindows 11 HomeandMS Office Home & Student 2024, its ready for work and study.Brand Warranty  To know more visit the warranty page on our website.\n\nKey Specs:\n-  Processor: Intel Core i3-1215U (6-Core8-Thread; 2Ã— P-cores @ 3.3-4.4 GHz + 4Ã— E-cores @ 1.2-3.3 GHz; 12 MB Cache)\n-  Graphics: Intel UHD Graphics (12 Execution Units; up to 1.25 GHz)\n-  Memory: 8 GB DDR4-3200 (On-board; Single-Channel; Non-upgradeable)\n-  Storage: 512 GB M.2 NVMe PCIe 3.0 SSD (Gen 3Ã—4; 2100 MBs Read; 1500 MBs Write)\n-  Display: 14â€³ FHD (1920Ã—1080) LED-Backlit; 60 Hz; 250 nits; Anti-Glare; 84% Screen-to-Body\n-  Audio: Built-in Stereo Speakers; AI Noise-Filtering Microphone\n-  Webcam: 720p HD with Shutter; f2.0 Aperture\n-  Keyboard: Chiclet; 1.4 mm Key Travel; Precision Touchpad\n-  Connectivity: WiFi 5 (802.11ac); Bluetooth 5.0\n-  Ports: 1Ã— USB 3.2 Gen 1 Type-C; 2Ã— USB 3.2 Gen 1 Type-A; 1Ã— HDMI 1.4; 1Ã— 3.5 mm Audio Combo\n-  Security: TPM 2.0; Webcam Privacy Shutter\n-  Battery: 42 WHr 2-Cell Li-ion; Up to 10 hrs Video Playback\n-  Power: 45 W AC Adapter\n-  Weight & Dimensions: 1.45 KG; 32.4Ã—21.2Ã—1.79 cm\n-  Certifications: ENERGY STAR; EPEAT Silver",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 38990,
    "sellingPrice": 37999.0,
    "categories": [
      "Laptops",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/81leoJuYYaL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS VivoBook X1404VA-NK804WS Intel Celeron N4500 Laptop (4GB DDR4 RAM, 256GB SSD, Intel UHD Graphics, Windows 11 Home in S Mode, MS Office Home & Student 2024, 14â€³ HD Display, Silver Gray, 1.4 KG)",
    "description": "Brand New Laptop The ASUS VivoBook X1404VA-NK804WS provides economical everyday computing in a compact, lightweight design. At its heart is theIntel Celeron N4500 processor(2-Core2-Thread; up to 2.8 GHz; 4 MB Smart Cache; 6 W TDP) withIntel UHD Graphics(12 EUs), ideal for web browsing, media playback, and office tasks. Equipped with4 GB DDR4-2400 RAMand a256 GB M.2 NVMe PCIe 3.0 SSD, it delivers quick system responsiveness and efficient multitasking. The14â€³ HD (1366Ã—768) LED-backlit displayoffers clear visuals with 250 nits brightness. Built inSilver Grayand weighing1.4 KG(32.4Ã—21.2Ã—1.79 cm), its perfectly portable for students and casual users. Preinstalled withWindows 11 Home in S ModeandMS Office Home & Student 2024, its secure and productivity-focused from day one.Brand Warranty  To know more visit the warranty page on our website.\n\nKey Specs:\n-  Processor: Intel Celeron N4500 (2-Core2-Thread; up to 2.8 GHz; 4 MB Cache)\n-  Graphics: Intel UHD Graphics (12 Execution Units; up to 650 MHz)\n-  Memory: 4 GB DDR4-2400 (On-board; Single-Channel; Non-upgradeable)\n-  Storage: 256 GB M.2 NVMe PCIe 3.0 SSD (Gen 3Ã—4; 2100 MBs Read; 1500 MBs Write)\n-  Display: 14â€³ HD (1366Ã—768) LED-Backlit; 60 Hz; 250 nits; Anti-Glare; 82% Screen-to-Body\n-  Audio: Built-in Stereo Speakers; DTS Audio Processing\n-  Webcam: 720p HD with Privacy Shutter\n-  Keyboard: Chiclet; 1.4 mm Key Travel; Precision Touchpad\n-  Connectivity: WiFi 5 (802.11ac); Bluetooth 4.2\n-  Ports: 1Ã— USB 3.2 Gen 1 Type-C; 2Ã— USB 3.2 Gen 1 Type-A; 1Ã— HDMI 1.4; 1Ã— 3.5 mm Audio Combo\n-  Security: TPM 2.0; OS in S Mode; Webcam Shutter\n-  Battery: 42 WHr 2-Cell Li-ion; Up to 9 hrs Web Browsing\n-  Power: 33 W AC Adapter\n-  Weight & Dimensions: 1.4 KG; 32.4Ã—21.2Ã—1.79 cm\n-  Certifications: ENERGY STAR; RoHS Compliant",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 48990,
    "sellingPrice": 47999.0,
    "categories": [
      "Laptops",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71oGM-26fZL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS Vivobook 16 X OLED X1607QA-MB050WS AMD Ryzen 7 8835HS Laptop (32 GB LPDDR5 RAM, 1 TB SSD, AMD Radeon 780M Graphics, Windows 11 Home, MS Office Home & Student 2024, 16â€³ 4K OLED Touchscreen, Cool Silver, 1.75 KG)",
    "description": "Brand New Laptop The ASUS Vivobook 16 X OLED X1607QA-MB050WS is a creators dream, combining cutting-edge AMD performance with stunning OLED visuals. Powered by theAMD Ryzen 7 8835HS processor(8-Core16-Thread; 2.34.5 GHz; 16 MB Cache; 45 W TDP; AMD AI Boost up to 16 TOPS) andAMD Radeon 780M Graphics(2 GB HBM2 + shared memory), it delivers lightning-fast rendering and smooth multitasking. With32 GB LPDDR5-6400 RAM(dual-channel) and a1 TB M.2 NVMe PCIe 4.0 SSD(Gen 4Ã—4; 70005500 MBs), large projects and applications open in an instant. The breathtaking16â€³ 4K (3840Ã—2400) OLED touchscreenwith 100% DCI-P3, 400 nits, HDR10, 0.2 ms response, 60 Hz, and TÃœV Rheinland Eye Care brings true-to-life color and detail. Encased in a sleekCool Silveraluminum chassis (dimensions: 36.1Ã—25.4Ã—1.79 cm; weight: 1.75 KG), its both stylish and portable. Preinstalled withWindows 11 HomeandMS Office Home & Student 2024, its ready for creative workflows.Brand Warranty  To know more visit the warranty page on our website.\n\nKey Specs:\n-  Processor: AMD Ryzen 7 8835HS (8-Core16-Thread; 2.34.5 GHz; 16 MB L3; 45 W TDP; AMD AI Boost up to 16 TOPS)\n-  Graphics: AMD Radeon 780M (2 GB HBM2 + shared; 2200 MHz)\n-  Memory: 32 GB LPDDR5-6400 (On-board; Dual-Channel; Non-upgradeable)\n-  Storage: 1 TB M.2 NVMe PCIe 4.0 SSD (Gen 4Ã—4; 7000 MBs Read; 5500 MBs Write)\n-  Display: 16â€³ OLED Touch (3840Ã—2400; 16:10; 60 Hz; 400 nits; HDR10; 0.2 ms; 100% DCI-P3; TÃœV Eye Care)\n-  Audio: Harman Kardon-Tuned Stereo Speakers; Dolby Atmos; AI Noise-Canceling Mic\n-  Webcam: 1080p FHD IR with Shutter; Windows Hello\n-  Keyboard: Backlit Chiclet; 1.4 mm Travel; Precision Touchpad; NumberPad 2.0\n-  Connectivity: WiFi 6E (802.11ax; 2Ã—2); Bluetooth 5.3; DTS:X Ultra\n-  Ports: 2Ã— Thunderbolt 4 (PD 100 W & DP); 1Ã— USB 3.2 Gen 2 Type-A; 1Ã— HDMI 2.1; 1Ã— 3.5 mm Combo\n-  Security: Fingerprint Reader; TPM 2.0; Kensington Lock\n-  Battery: 90 WHr 4-Cell Li-ion; Fast Charge (060% in 39 min); Up to 14 hrs Video\n-  Power: 100 W USB-C Adapter; PD 3.0\n-  Certifications: ENERGY STAR; EPEAT Gold; MIL-STD-810H Tested",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 61990,
    "sellingPrice": 59999.0,
    "categories": [
      "Laptops",
      "Creator"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/81PaO9Q1WFL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ASUS Zenbook Pro Duo UX5406SA-PZ7761WS Intel Core Ultra 9 285H 2-in-1 Laptop (32 GB LPDDR5 RAM, 1 TB SSD, NVIDIA GeForce RTX 4050 8 GB, Windows 11 Pro, MS Office Home & Student 2024, 14.5â€³ 4K OLED Main + 12.7â€³ ScreenPad Plus, Celestial Blue, 2.4 KG)",
    "description": "Brand New Laptop The ASUS Zenbook Pro Duo UX5406SA-PZ7761WS elevates productivity with dual-screen innovation and top-tier performance. Driven by theIntel Core Ultra 9 285H processor(16-Core24-Thread; 8Ã— P-cores + 8Ã— E-cores; up to 5.1 GHz; 30 MB Cache; AI NPU up to 17 TOPS) andNVIDIA GeForce RTX 4050 Laptop GPU(8 GB GDDR6), it handles complex creative tasks effortlessly. With32 GB LPDDR5-6400 RAMand a1 TB M.2 NVMe PCIe 4.0 SSD(Gen 4Ã—4; 70005000 MBs), workflows are seamless. The14.5â€³ 4K (2880Ã—1800) OLED main display(120 Hz; 500 nits; 100% DCI-P3; HDR10; 0.2 ms) pairs with a12.7â€³ 2.8K (2880Ã—864) ScreenPad Plusfor enhanced multitasking. Encased inCelestial Bluealuminum (dimensions: 32.5Ã—23.4Ã—1.95 cm; weight: 2.4 KG), it offers durability and style. Preinstalled withWindows 11 ProandMS Office Home & Student 2024, its a powerhouse for creators.Brand Warranty  To know more visit the warranty page on our website.\n\nKey Specs:\n-  Processor: Intel Core Ultra 9 285H (16-Core24-Thread; up to 5.1 GHz; 30 MB Cache; AI NPU up to 17 TOPS; 45 W TDP)\n-  Graphics: NVIDIA GeForce RTX 4050 (8 GB GDDR6; 80 W; Ray Tracing; DLSS)\n-  Memory: 32 GB LPDDR5-6400 (On-board; Dual-Channel; Non-upgradeable)\n-  Storage: 1 TB M.2 NVMe PCIe 4.0 SSD (Gen 4Ã—4; 7000 MBs Read; 5000 MBs Write)\n-  Main Display: 14.5â€³ OLED Touch (2880Ã—1800; 16:10; 120 Hz; 500 nits; HDR10; 100% DCI-P3; 0.2 ms; TÃœV Eye Care)\n-  ScreenPad Plus: 12.7â€³ (2880Ã—864; 120 Hz; 400 nits; Multi-Touch; Pen Support)\n-  Audio: Duo Speakers with Dolby Atmos; Harman Kardon; AI Noise Canceling Mic\n-  Webcam: 1080p FHD IR with Shutter; Windows Hello\n-  Keyboard: Backlit Chiclet; 1.5 mm Travel; Precision Touchpad; NumberPad 2.0\n-  Connectivity: WiFi 6E; Bluetooth 5.3; Thunderbolt 4; DTS:X Ultra\n-  Ports: 2Ã— Thunderbolt 4 (PD & DP); 1Ã— USB 3.2 Gen 2 Type-A; 1Ã— HDMI 2.1; 1Ã— 3.5 mm Combo\n-  Security: Fingerprint Reader; TPM 2.0; Kensington Lock\n-  Battery: 90 WHr 6-Cell Li-ion; Fast Charge; Up to 13 hrs Video\n-  Power: 180 W AC Adapter; PD Fast Charge\n-  Certifications: ENERGY STAR; EPEAT Gold; MIL-STD-810H Tested",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 149990,
    "sellingPrice": 144999.0,
    "categories": [
      "Laptops",
      "Creator"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71bgBRw4sqL._AC_UY218_.jpg"
    ],
    "brand": "ASUS"
  },
  {
    "name": "ACER Aspire Lite AL15-41 15.6 Laptop (AMD Ryzen 3 5300U  8 GB DDR4  512 GB NVMe SSD  AMD Radeon Graphics  Windows 11 Home  MS Office Home & Student 2024  Steel Gray  1.78 KG)",
    "description": "Brand New Laptop The ACER Aspire Lite AL15-41 delivers reliable performance for students and professionals at an exceptional value. Powered by theAMD Ryzen 3 5300U processor(4 Cores8 Threads; 2.63.8 GHz; 6 MB Cache; 15 W TDP) with integratedAMD Radeon Graphics(6 CUs; up to 1600 MHz), it handles multitasking, streaming, and light productivity tasks smoothly. Equipped with8 GB DDR4-3200 RAM(expandable to 20 GB) and a512 GB M.2 NVMe PCIe SSD(Gen 3×4; 2100 MBs Read), enjoy fast boot times and responsive app performance. The15.6 Full HD (1920×1080) IPS displaywith ComfyView anti-glare technology and 60 Hz refresh provides comfortable viewing. Built inSteel Graywith a slim profile (36.2×23.8×1.79 cm; 1.78 KG), it's perfect for mobility. Preinstalled withWindows 11 HomeandMS Office Home & Student 2024, it's productivity-ready from day one.Brand Warranty  To know more visit the warranty page on our website.          \nKey Specs:\n- Processor: AMD Ryzen 3 5300U (4 C8 T; 2.63.8 GHz; 6 MB Cache; 15 W TDP)\n- Graphics: AMD Radeon Graphics (6 CUs; up to 1600 MHz)\n- Memory: 8 GB DDR4-3200 (4 GB On-board + 4 GB SO-DIMM; Expandable to 20 GB)\n- Storage: 512 GB M.2 NVMe PCIe SSD (Gen 3×4; 2100 MBs Read; 1500 MBs Write)\n- Display: 15.6 FHD IPS (1920×1080); 60 Hz; 250 nits; ComfyView Anti-Glare; 82% Screen-to-Body\n- Operating System: Windows 11 Home Pre-installed\n- Office Suite: MS Office Home & Student 2024 Pre-installed\n- Color: Steel Gray\n- Weight & Dimensions: 1.78 KG; 36.2×23.8×1.79 cm\n- Connectivity: WiFi 6 (802.11ax); Bluetooth 5.1\n- Ports: 1× USB 3.2 Gen 1 Type-C; 2× USB 3.2 Gen 1 Type-A; 1× USB 2.0; 1× HDMI 1.4; 1× RJ45; 1× 3.5 mm Audio Jack\n- Keyboard: Full-size Chiclet; Numeric Keypad\n- Audio: Acer TrueHarmony Speakers; High Definition Audio\n- Webcam: 720p HD with Privacy Shutter\n- Battery: 50 WHr 3-Cell Li-ion; Up to 9.5 hrs Video Playback\n- Power: 65 W AC Adapter\n- Security: TPM 2.0; Kensington Lock Slot\n- Certifications: ENERGY STAR; EPEAT Silver                                                                                                                                                                                                                                                                                                                                                                           ",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 48999,
    "sellingPrice": 24299.0,
    "categories": [
      "",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/81leoJuYYaL._AC_UY218_.jpg"
    ],
    "brand": "ACER"
  },
  {
    "name": "ACER Aspire 3 A315-510P 15.6 Laptop (Intel Core i3-13  8 GB DDR5  512 GB NVMe SSD  Intel UHD Graphics  Windows 11 Home  MS Office Home & Student 2024  Pure Silver  1.78 KG)",
    "description": "Brand New Laptop The ACER Aspire 3 A315-510P offers modern Intel performance in a sleek, affordable package. Featuring theIntel Core i3-N305 processor(8 Cores; up to 3.8 GHz; 6 MB Cache; 15 W TDP) withIntel UHD Graphics(32 EUs; up to 1.25 GHz), it delivers efficient performance for everyday computing, web browsing, and office applications. With8 GB DDR5-5500 RAM(4 GB On-board + 4 GB SO-DIMM; expandable to 20 GB) and a512 GB M.2 NVMe PCIe 4.0 SSD(Gen 4×4; 3500 MBs Read), experience lightning-fast responsiveness. The15.6 FHD (1920×1080) IPS displaywith ComfyView anti-glare coating delivers vibrant colors and comfortable viewing. Housed inPure Silver(36.2×23.8×1.99 cm; 1.78 KG), it combines style with portability. Preloaded withWindows 11 HomeandMS Office Home & Student 2024for immediate productivity.Brand Warranty  To know more visit the warranty page on our website.\n\nKey Specs:\n- Processor: Intel Core i3-N305 (8 Cores; up to 3.8 GHz; 6 MB Cache; 15 W TDP)\n- Graphics: Intel UHD Graphics (32 EUs; up to 1.25 GHz)\n- Memory: 8 GB DDR5-5500 (4 GB On-board + 4 GB SO-DIMM; Expandable to 20 GB)\n- Storage: 512 GB M.2 NVMe PCIe 4.0 SSD (Gen 4×4; 3500 MBs Read; 3000 MBs Write)\n- Display: 15.6 FHD IPS (1920×1080); 60 Hz; 250 nits; ComfyView Anti-Glare\n- Operating System: Windows 11 Home Pre-installed\n- Office Suite: MS Office Home & Student 2024 Pre-installed\n- Color: Pure Silver\n- Weight & Dimensions: 1.78 KG; 36.2×23.8×1.99 cm\n- Connectivity: WiFi 6 (802.11ax); Bluetooth 5.1\n- Ports: 1× USB 3.2 Gen 2 Type-C; 2× USB 3.2 Gen 1 Type-A; 1× USB 2.0; 1× HDMI 2.1; 1× RJ45; 1× 3.5 mm Audio Jack\n- Keyboard: Full-size Chiclet; Numeric Keypad; Precision Touchpad\n- Audio: Acer TrueHarmony; DTS Audio\n- Webcam: 720p HD with Privacy Shutter\n- Battery: 50 WHr 3-Cell Li-ion; Up to 10 hrs Mixed Use\n- Power: 65 W USB-C Adapter; PD Support\n- Security: TPM 2.0; Fingerprint Reader\n- Certifications: ENERGY STAR; RoHS Compliant",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 50000,
    "sellingPrice": 39999.0,
    "categories": [
      "",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/81leoJuYYaL._AC_UY218_.jpg"
    ],
    "brand": "ACER"
  },
  {
    "name": "ACER Aspire 3 A315-510P 15.6 Performance Laptop (Intel Core i5-1335U  8 GB DDR5  512 GB NVMe SSD  Intel Iris Xe Graphics  Windows 11 Home  MS Office Home & Student 2024  Charcoal Black  1.78 KG)",
    "description": "Brand New Laptop The ACER Aspire 3 A315-510P with Intel Core i5 delivers enhanced performance for demanding productivity and multimedia tasks. Powered by theIntel Core i5-1335U processor(10 Cores: 2 P-cores + 8 E-cores; up to 4.6 GHz; 12 MB Cache; 15 W TDP) andIntel Iris Xe Graphics(80 EUs; up to 1.25 GHz), it handles content creation, light gaming, and multitasking with ease. Featuring8 GB DDR5-5500 RAM(expandable to 20 GB) and a512 GB M.2 NVMe PCIe 4.0 SSD, enjoy seamless performance and rapid file access. The15.6 FHD IPS displaywith 250 nits brightness and anti-glare coating ensures comfortable productivity sessions. Built inCharcoal Black(36.2×23.8×1.99 cm; 1.78 KG), it's both professional and portable. Comes withWindows 11 HomeandMS Office Home & Student 2024preinstalled.Brand Warranty  To know more visit the warranty page on our website.\n\nKey Specs:\n- Processor: Intel Core i5-1335U (10 C: 2 P + 8 E; up to 4.6 GHz; 12 MB Cache; 15 W TDP)\n- Graphics: Intel Iris Xe Graphics (80 EUs; up to 1.25 GHz)\n- Memory: 8 GB DDR5-5500 (4 GB On-board + 4 GB SO-DIMM; Expandable to 20 GB)\n- Storage: 512 GB M.2 NVMe PCIe 4.0 SSD (Gen 4×4; 3500 MBs Read)\n- Display: 15.6 FHD IPS (1920×1080); 60 Hz; 250 nits; ComfyView Anti-Glare\n- Operating System: Windows 11 Home Pre-installed\n- Office Suite: MS Office Home & Student 2024 Pre-installed\n- Color: Charcoal Black\n- Weight & Dimensions: 1.78 KG; 36.2×23.8×1.99 cm\n- Connectivity: WiFi 6 (802.11ax); Bluetooth 5.1\n- Ports: USB 3.2 Gen 2 Type-C; USB 3.2 Gen 1 Type-A; HDMI 2.1; RJ45; Audio Jack\n- Battery: 50 WHr 3-Cell Li-ion; Up to 11 hrs Mixed Use\n- Security: TPM 2.0; Fingerprint Reader\n- Certifications: ENERGY STAR",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 55000,
    "sellingPrice": 40399.0,
    "categories": [
      "",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71TpwcAN1PL._AC_UY218_.jpg"
    ],
    "brand": "ACER"
  },
  {
    "name": "ACER Aspire 3 A315-510P 15.6 Premium Laptop (Intel Core i5-1335U  16 GB DDR5  512 GB NVMe SSD  Intel Iris Xe Graphics  Windows 11 Home  MS Office Home & Student 2024  3 Years Warranty  Charcoal Black  1.78 KG)",
    "description": "Brand New Laptop The ACER Aspire 3 Premium Edition with16 GB DDR5 RAMand3 Years Warrantyis designed for power users requiring enhanced multitasking capabilities. Powered by theIntel Core i5-1335UandIntel Iris Xe Graphics, it handles demanding applications, content creation, and advanced productivity with ease. The16 GB DDR5-5500 RAM(8 GB On-board + 8 GB SO-DIMM; expandable to 24 GB) ensures smooth performance across multiple applications. Combined with a512 GB PCIe 4.0 SSD, experience lightning-fast responsiveness. The15.6 FHD IPS displaydelivers crisp visuals for professional work. Built inCharcoal Black(36.2×23.8×1.99 cm; 1.78 KG) with3 Years Warrantyfor maximum protection.Brand Warranty  To know more visit the warranty page on our website.\n\nKey Specs:\n- Processor: Intel Core i5-1335U (10 C: 2 P + 8 E; up to 4.6 GHz)\n- Graphics: Intel Iris Xe Graphics (80 EUs)\n- Memory: 16 GB DDR5-5500 (8 GB On-board + 8 GB SO-DIMM; Expandable to 24 GB)\n- Storage: 512 GB M.2 NVMe PCIe 4.0 SSD\n- Display: 15.6 FHD IPS; 60 Hz; 250 nits; Anti-Glare\n- Operating System: Windows 11 Home\n- Office Suite: MS Office Home & Student 2024\n- Warranty: 3 Years Extended Warranty\n- Color: Charcoal Black\n- Weight & Dimensions: 1.78 KG; 36.2×23.8×1.99 cm\n- Battery: 50 WHr; Up to 12 hrs Mixed Use",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 70000,
    "sellingPrice": 40399.0,
    "categories": [
      "",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/61yC4DN4asL._AC_UY218_.jpg"
    ],
    "brand": "ACER"
  },
  {
    "name": "DELL Inspiron 5440 14 Compact Laptop (Intel Core i3-1315U  8 GB DDR4  512 GB NVMe SSD  Intel UHD Graphics  Windows 11 Home  MS Office Home & Student 2024  Platinum Silver  1.59 KG)",
    "description": "Brand New Laptop  The DELL Inspiron 5440 combines portability with reliable performance in a premium 14 form factor. Powered by the Intel Core i3-1315U processor (6 Cores: 2 P-cores + 4 E-cores; up to 4.5 GHz; 10 MB Cache; 15 W TDP) with Intel UHD Graphics (64 EUs), it delivers efficient performance for productivity and multimedia tasks. Featuring 8 GB DDR4-3200 RAM (expandable to 32 GB) and a 512 GB M.2 NVMe PCIe SSD, enjoy responsive multitasking and fast file access. The 14 FHD (1920×1080) WVA display with anti-glare coating and narrow bezels provides comfortable viewing. Built in Platinum Silver with a sleek aluminum finish (31.4×22.6×1.57 cm; 1.59 KG), it's perfect for professionals on the move. Includes Windows 11 Home and MS Office Home & Student 2024. Brand Warranty  To know more visit the warranty page on our website.\n\nKey Specs:\n- Processor: Intel Core i3-1315U (6 C: 2 P + 4 E; up to 4.5 GHz; 10 MB Cache)\n- Graphics: Intel UHD Graphics (64 EUs)\n- Memory: 8 GB DDR4-3200 (Expandable to 32 GB)\n- Storage: 512 GB M.2 NVMe PCIe SSD\n- Display: 14 FHD WVA; 60 Hz; 250 nits; Anti-Glare\n- Operating System: Windows 11 Home\n- Office Suite: MS Office Home & Student 2024\n- Color: Platinum Silver\n- Weight & Dimensions: 1.59 KG; 31.4×22.6×1.57 cm\n- Connectivity: WiFi 6; Bluetooth 5.1\n- Battery: 54 WHr; Up to 10 hrs Mixed Use",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 40000,
    "sellingPrice": 28999.0,
    "categories": [
      "",
      "Office",
      "Student"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/71I7xDIyINL._AC_UY218_.jpg"
    ],
    "brand": "DELL"
  },
  {
    "name": "DELL Latitude 3450 14 Business Laptop (Intel Core i5-1335U  8 GB DDR4  512 GB NVMe SSD  Intel Iris Xe Graphics  Windows 11 Pro  MS Office Home & Student 2024  3 Years Warranty  Carbon Black  1.61 KG)",
    "description": "Brand New Laptop  The DELL Latitude 3450 is engineered for business professionals requiring enterprise-grade reliability and security. Powered by the Intel Core i5-1335U and Intel Iris Xe Graphics, it delivers robust performance for business applications and multitasking. With 8 GB DDR4-3200 RAM (expandable to 32 GB) and a 512 GB PCIe SSD, experience seamless workflow performance. The 14 FHD (1920×1080) anti-glare display ensures clear visibility in any environment. Built with military-grade durability in Carbon Black (32.2×21.2×1.89 cm; 1.61 KG), it withstands demanding business use. Includes Windows 11 Pro, MS Office Home & Student 2024, and comprehensive 3 Years Business Warranty. Brand Warranty  To know more visit the warranty page on our website.\n\nKey Specs:\n- Processor: Intel Core i5-1335U (10 C: 2 P + 8 E; up to 4.6 GHz)\n- Graphics: Intel Iris Xe Graphics\n- Memory: 8 GB DDR4-3200 (Expandable to 32 GB)\n- Storage: 512 GB M.2 NVMe PCIe SSD\n- Display: 14 FHD; 60 Hz; 250 nits; Anti-Glare\n- Operating System: Windows 11 Pro\n- Office Suite: MS Office Home & Student 2024\n- Warranty: 3 Years Business Warranty\n- Color: Carbon Black\n- Security: TPM 2.0; Fingerprint Reader; Smart Card Reader\n- Connectivity: WiFi 6E; Bluetooth 5.3\n- Certifications: MIL-STD-810H Tested",
    "stock": 10,
    "boxpack": true,
    "actualPrice": 60000,
    "sellingPrice": 48499.0,
    "categories": [
      "",
      "Gaming"
    ],
    "images": [
      "https://m.media-amazon.com/images/I/61qhSg55mbL._AC_UY218_.jpg"
    ],
    "brand": "DELL"
  }
]